/* automatically generated by rust-bindgen 0.71.1 */

#![allow(dead_code)]

#[derive(PartialEq, Copy, Clone, Hash, Debug, Default)]
#[repr(C)]
pub struct __BindgenComplex<T> {
    pub re: T,
    pub im: T,
}

pub type QkComplex32 = __BindgenComplex<f32>;
pub type QkComplex64 = __BindgenComplex<f64>;
pub type QkGate = u8;
pub type QkBitTerm = u8;
pub type QkExitCode = u32;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct QkCircuit {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct QkObs {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct QkOpCount {
    pub name: *const ::std::os::raw::c_char,
    pub count: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of QkOpCount"][::std::mem::size_of::<QkOpCount>() - 16usize];
    ["Alignment of QkOpCount"][::std::mem::align_of::<QkOpCount>() - 8usize];
    ["Offset of field: QkOpCount::name"][::std::mem::offset_of!(QkOpCount, name) - 0usize];
    ["Offset of field: QkOpCount::count"][::std::mem::offset_of!(QkOpCount, count) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct QkOpCounts {
    pub data: *mut QkOpCount,
    pub len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of QkOpCounts"][::std::mem::size_of::<QkOpCounts>() - 16usize];
    ["Alignment of QkOpCounts"][::std::mem::align_of::<QkOpCounts>() - 8usize];
    ["Offset of field: QkOpCounts::data"][::std::mem::offset_of!(QkOpCounts, data) - 0usize];
    ["Offset of field: QkOpCounts::len"][::std::mem::offset_of!(QkOpCounts, len) - 8usize];
};
#[doc = " @ingroup QkCircuit\n\n A circuit instruction representation.\n\n This struct represents the data contained in an individual instruction in a ``QkCircuit``.\n It is not a pointer to the underlying object, but contains a copy of the properties of the\n instruction for inspection."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct QkCircuitInstruction {
    #[doc = " The instruction name"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = " The number of qubits for this instruction."]
    pub num_qubits: u32,
    #[doc = " A pointer to an array of qubit indices this instruction operates on."]
    pub qubits: *mut u32,
    #[doc = " The number of clbits for this instruction."]
    pub num_clbits: u32,
    #[doc = " A pointer to an array of clbit indices this instruction operates on."]
    pub clbits: *mut u32,
    #[doc = " The number of parameters for this instruction."]
    pub num_params: u32,
    #[doc = " A pointer to an array of parameter values for this instruction."]
    pub params: *mut f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of QkCircuitInstruction"][::std::mem::size_of::<QkCircuitInstruction>() - 56usize];
    ["Alignment of QkCircuitInstruction"][::std::mem::align_of::<QkCircuitInstruction>() - 8usize];
    ["Offset of field: QkCircuitInstruction::name"]
        [::std::mem::offset_of!(QkCircuitInstruction, name) - 0usize];
    ["Offset of field: QkCircuitInstruction::num_qubits"]
        [::std::mem::offset_of!(QkCircuitInstruction, num_qubits) - 8usize];
    ["Offset of field: QkCircuitInstruction::qubits"]
        [::std::mem::offset_of!(QkCircuitInstruction, qubits) - 16usize];
    ["Offset of field: QkCircuitInstruction::num_clbits"]
        [::std::mem::offset_of!(QkCircuitInstruction, num_clbits) - 24usize];
    ["Offset of field: QkCircuitInstruction::clbits"]
        [::std::mem::offset_of!(QkCircuitInstruction, clbits) - 32usize];
    ["Offset of field: QkCircuitInstruction::num_params"]
        [::std::mem::offset_of!(QkCircuitInstruction, num_params) - 40usize];
    ["Offset of field: QkCircuitInstruction::params"]
        [::std::mem::offset_of!(QkCircuitInstruction, params) - 48usize];
};
#[doc = " A term in a ``QkObs``.\n\n This contains the coefficient (``coeff``), the number of qubits of the observable\n (``num_qubits``) and pointers to the ``bit_terms`` and ``indices`` arrays, which have\n length ``len``. It's the responsibility of the user that the data is coherent,\n see also the below section on safety.\n\n # Safety\n\n * ``bit_terms`` must be a non-null, aligned pointer to ``len`` elements of type ``QkBitTerm``.\n * ``indices`` must be a non-null, aligned pointer to ``len`` elements of type ``uint32_t``."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct QkObsTerm {
    #[doc = " The coefficient of the observable term."]
    pub coeff: QkComplex64,
    #[doc = " Length of the ``bit_terms`` and ``indices`` arrays."]
    pub len: usize,
    #[doc = " A non-null, aligned pointer to ``len`` elements of type ``QkBitTerm``."]
    pub bit_terms: *mut QkBitTerm,
    #[doc = " A non-null, aligned pointer to ``len`` elements of type ``uint32_t``."]
    pub indices: *mut u32,
    #[doc = " The number of qubits the observable term is defined on."]
    pub num_qubits: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of QkObsTerm"][::std::mem::size_of::<QkObsTerm>() - 48usize];
    ["Alignment of QkObsTerm"][::std::mem::align_of::<QkObsTerm>() - 8usize];
    ["Offset of field: QkObsTerm::coeff"][::std::mem::offset_of!(QkObsTerm, coeff) - 0usize];
    ["Offset of field: QkObsTerm::len"][::std::mem::offset_of!(QkObsTerm, len) - 16usize];
    ["Offset of field: QkObsTerm::bit_terms"]
        [::std::mem::offset_of!(QkObsTerm, bit_terms) - 24usize];
    ["Offset of field: QkObsTerm::indices"][::std::mem::offset_of!(QkObsTerm, indices) - 32usize];
    ["Offset of field: QkObsTerm::num_qubits"]
        [::std::mem::offset_of!(QkObsTerm, num_qubits) - 40usize];
};
unsafe extern "C" {
    #[doc = " @ingroup QkCircuit\n Construct a new circuit with the given number of qubits and clbits.\n\n @param num_qubits The number of qubits the circuit contains.\n @param num_clbits The number of clbits the circuit contains.\n\n @return A pointer to the created circuit.\n\n # Example\n\n     QkCircuit *empty = qk_circuit_new(100, 100);\n"]
    pub fn qk_circuit_new(num_qubits: u32, num_clbits: u32) -> *mut QkCircuit;
}
unsafe extern "C" {
